#include <ภาษาไทย_เต็ม.h>

ใช้งาน ขอบเขตชื่อ มาตรฐาน ครับ
มีเครื่องหมาย หลัก(){
    นำเข้า.ผูก(ไม่ปรากฏตัวชี้)->เชื่อมต่อกับเอสทีดีไอโอ(เท็จ);
    เลข น,ม,ษ,ข้อจำกัด,ก,ข,ค ครับ
    นำเข้า >> น >> ม >> ษ >> ข้อจำกัด ครับ
    เวกเตอร์<คลล> กราฟ[น] ครับ
    สำหรับ(เลข ด=0; ด<ม; ด++){
        นำเข้า >> ก >> ข >> ค ครับ
        ก-- ครับ ข-- ครับ
        กราฟ[ก].ดันหลัง({ข,ค}) ครับ
        กราฟ[ข].ดันหลัง({ก,ค}) ครับ
    }
    เลข ระยะ[2][น] ครับ
    ค่าความจริง เยี่ยม[2][น] ครับ
    คิวสำคัญ<คู่<เลข,คลล>> คส ครับ
    สำหรับ(เลข ด=0; ด<น; ด++) ระยะ[0][ด]=ระยะ[1][ด]=อนันต์ ครับ
    ตั้งหน่วยความจำ(เยี่ยม,เท็จ,ขนาดของ(เยี่ยม)) ครับ
    ระยะ[0][0]=0;
    คส.ดัน({0,{0,0}}) ครับ
    ขณะที่(!คส.ว่าง()){
        คลล ตัวบน=คส.บน().ส ครับ
        คส.นำออก() ครับ
        ถ้า(เยี่ยม[ตัวบน.ร][ตัวบน.ส]) ทำต่อไป ครับ
        เยี่ยม[ตัวบน.ร][ตัวบน.ส]=จริง ครับ
        สำหรับ(อัตโนมัติ โหนด: กราฟ[ตัวบน.ส]) ถ้า(!เยี่ยม[ตัวบน.ร][โหนด.ร] && ระยะ[ตัวบน.ร][ตัวบน.ส]+โหนด.ส<ระยะ[ตัวบน.ร][โหนด.ร]){
            ระยะ[ตัวบน.ร][โหนด.ร]=ระยะ[ตัวบน.ร][ตัวบน.ส]+โหนด.ส ครับ
            คส.ดัน({-ระยะ[ตัวบน.ร][โหนด.ร],{ตัวบน.ร,โหนด.ร}}) ครับ
        }
        ถ้า(!ตัวบน.ร) สำหรับ(อัตโนมัติ โหนด: กราฟ[ตัวบน.ส]) ถ้า(!เยี่ยม[!ตัวบน.ร][โหนด.ร] && ระยะ[ตัวบน.ร][ตัวบน.ส]+ษ<ระยะ[!ตัวบน.ร][โหนด.ร]){
            ระยะ[!ตัวบน.ร][โหนด.ร]=ระยะ[ตัวบน.ร][ตัวบน.ส]+ษ ครับ
            คส.ดัน({-ระยะ[!ตัวบน.ร][โหนด.ร],{!ตัวบน.ร,โหนด.ร}}) ครับ
        }
    }
    เลข คำตอบ=น้อยที่สุด(ระยะ[0][น-1],ระยะ[1][น-1]) ครับ
    ถ้า(คำตอบ<=ข้อจำกัด) ส่งออก << "Happy Winnie the Pooh :3" << จบบรรทัด << คำตอบ << จบบรรทัด ครับ
    ไม่เช่นนั้น ส่งออก << "No Honey TT" << จบบรรทัด ครับ
    ส่งกลับ 0 ครับ
}
